Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/basic/data.po
Languages: sv

source: Prepare Data
sv: Förbereda data

source: To be able to use pgRouting, data has to be imported into a database.
sv: För att kunna använda pgRouting måste data importeras till en databas.

source: Chapter Contents
sv: Kapitelinnehåll

source: Prepare the database
sv: Förbereda databasen

source: pgRouting is installed as extension. This requires:
sv: pgRouting installeras som tillägg. Detta kräver:

source: These requirements are met on OSGeoLive. When the required software is installed, open a terminal window by pressing :code:`ctrl-alt-t` and follow the instructions.
sv: Dessa krav uppfylls på OSGeoLive. När den programvara som krävs är installerad, öppna ett terminalfönster genom att trycka på :code:`ctrl-alt-t` och följ instruktionerna.

source: Information about installing OSGeoLive can be found on :doc:`../general-intro/osgeolive`.
sv: Information om hur du installerar OSGeoLive finns på :doc:`../general-intro/osgeolive`.

source: If OSGeoLive is not being used, please refer to the chapter's appendix to set up the user ``user``.
sv: Om OSGeoLive inte används, se kapitlets appendix för att ställa in användaren ``user``.

source: Create a pgRouting compatible database
sv: Skapa en databas som är kompatibel med pgRouting

source: Depending on the postgres configuration :code:`-U <user>` is needed on :code:`psql` commands
sv: Beroende på postgres-konfigurationen behövs :code:`-U <user>` för :code:`psql`-kommandon

source: To exit the database use ``\q``
sv: För att lämna databasen använd ``\q``

source: Get the Workshop Data
sv: Hämta verkstadsdata

source: The pgRouting workshop will make use of OpenStreetMap data, which is already available on `OSGeoLive <https://live.osgeo.org>`_. This workshop will use the ``Belém`` city data and is a snapshot of Sep 2024.
sv: Workshopen pgRouting kommer att använda OpenStreetMap-data, som redan finns tillgängliga på `OSGeoLive <https://live.osgeo.org>`_. Den här workshopen kommer att använda stadsdata från ``Belém`` och är en ögonblicksbild av september 2024.

source: Getting the data
sv: Hämta data

source: Option 1) When using OSGeoLive
sv: Alternativ 1) När du använder OSGeoLive

source: OSGeoLive comes with OSM data from the city of Belém.
sv: OSGeoLive levereras med OSM-data från staden Belém.

source: Option 2) Download data form OSGeoLive website
sv: Alternativ 2) Ladda ner data från OSGeoLives webbplats

source: The exact same data can be found on the OSGeoLive download page.
sv: Exakt samma data finns på nedladdningssidan för OSGeoLive.

source: Option 3) Download using Overpass XAPI
sv: Alternativ 3) Ladda ner med hjälp av Overpass XAPI

source: The following downloads the latest OSM data on using the same area. Using this data in the workshop can generate variations in the results, due to changes since Sep 2024.
sv: Följande nedladdningar av de senaste OSM-data om användning av samma område. Om du använder dessa data i workshopen kan det leda till variationer i resultaten på grund av ändringar sedan september 2024.

source: More information about how to download OpenStreetMap data can be found in https://wiki.openstreetmap.org/wiki/Downloading_data
sv: Mer information om hur du laddar ner OpenStreetMap-data finns på https://wiki.openstreetmap.org/wiki/Downloading_data

source: An alternative for very large areas is to use the download services of `Geofabrik <https://download.geofabrik.de>`_.
sv: Ett alternativ för mycket stora områden är att använda nedladdningstjänsterna från `Geofabrik <https://download.geofabrik.de>`_.

source: Upload data to the database
sv: Ladda upp data till databasen

source: The next step is to run ``osm2pgrouting`` converter, which is a command line tool that inserts the data in the database, "ready" to be used with pgRouting. Additional information about ``osm2pgrouting`` can be found at the :doc:`../appendix/appendix-3`
sv: Nästa steg är att köra ``osm2pgrouting`` converter, som är ett kommandoradsverktyg som infogar data i databasen, "redo" att användas med pgRouting. Ytterligare information om ``osm2pgrouting`` finns i :doc:`../appendix/appendix-3`

source: For this step:
sv: För detta steg:

source: the osm2pgrouting default ``mapconfig.xml`` configuration file is used
sv: osm2pgroutings standardkonfigurationsfil ``mapconfig.xml`` används

source: and the ``~/Desktop/workshop/BELEM_BR.osm`` data
sv: och data från ``~/Desktop/workshop/BELEM_BR.osm``

source: with the ``city_routing`` database
sv: med databasen ``city_routing``

source: From a terminal window :code:`ctrl-alt-t`.
sv: Från ett terminalfönster :code:`ctrl-alt-t`.

source: Run the osm2pgrouting converter
sv: Kör konverteraren osm2pgrouting

source: Depending on the osm2pgrouting version `-W password` is needed
sv: Beroende på osm2pgrouting-versionen behövs `-W lösenord`

source: Output:
sv: Utdata:

source: Tables on the database
sv: Tabeller i databasen

source: If everything went well the result should look like this:
sv: Om allt gick bra borde resultatet se ut så här:

source: Chapter: Appendix
sv: Kapitel: Bilaga

source: OSGeoLive's account name on the database is ``user``. To easily use the workshop when not using OSGeoLive this extra steps are needed:
sv: OSGeoLives kontonamn i databasen är ``user``. För att enkelt kunna använda workshopen när du inte använder OSGeoLive behövs dessa extra steg:
