Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/basic/sql_function.po
Languages: sv

source: SQL function
sv: SQL-funktion

source: Chapter Contents
sv: Kapitelinnehåll

source: pgRouting functions provide `low level` interface.
sv: pgRouting-funktioner ger ett gränssnitt på "låg nivå".

source: When developing for a `higher level` application, the requirements need to be represented in the SQL queries. As these SQL queries get more complex, it is desirable to store them in postgreSQL stored procedures or functions. Stored procedures or functions are an effective way to wrap application logic, in this case, related to routing logic and requirements.
sv: När du utvecklar för en applikation på "högre nivå" måste kraven representeras i SQL-frågorna. Eftersom dessa SQL-frågor blir mer komplexa är det önskvärt att lagra dem i postgreSQL-lagrade procedurer eller funktioner. Lagrade procedurer eller funktioner är ett effektivt sätt att linda in applikationslogik, i det här fallet relaterat till routinglogik och krav.

source: The application requirements
sv: Kraven för ansökan

source: A front end needs the following routing information:
sv: En frontend behöver följande routningsinformation:

source: ``seq`` - A unique identifier of the rows
sv: ``seq`` - En unik identifierare av raderna

source: ``id`` - The segment's identifier
sv: ``id`` - Segmentets identifierare

source: ``name`` - The segment's name
sv: ``name`` - Segmentets namn

source: ``length`` - The segment's length
sv: ``length`` - Segmentets längd

source: ``seconds`` - Number of seconds to traverse the segment
sv: ``seconds`` - Antal sekunder för att korsa segmentet

source: ``azimuth`` - The azimuth of the segment
sv: ``azimuth`` - Segmentets azimut

source: ``route_geom`` - The routing geometry
sv: ``route_geom`` - Routinggeometrin

source: ``route_readable`` - The geometry in human readable form.
sv: ``route_readable`` - Geometrin i läsbar form för människor.

source: Design of the function
sv: Utformning av funktionen

source: The function to be created ``wrk_dijkstra`` with the following input parameters and output columns:
sv: Den funktion som skall skapas är ``wrk_dijkstra`` med följande inparametrar och utdatakolumner:

source: Input parameters
sv: Parametrar för inmatning

source: Type
sv: Typ

source: Description
sv: Beskrivning

source: The table/view that is going to be used for processing
sv: Den tabell/vy som kommer att användas för bearbetning

source: The OSM identifier of the `departure` location.
sv: OSM-identifieraren för platsen för `departure`.

source: The OSM identifier of the `destination` location.
sv: OSM-identifieraren för platsen `destination`.

source: output columns
sv: utmatningskolumner

source: Name
sv: Namn

source: INTEGER
sv: HELTAL

source: A unique number for each result row.
sv: Ett unikt nummer för varje resultatrad.

source: The edge identifier.
sv: Identifieraren för kanten.

source: The name of the segment.
sv: Namnet på segmentet.

source: The number of seconds it takes to traverse the segment.
sv: Antal sekunder det tar att korsa segmentet.

source: The azimuth of the segment.
sv: Segmentets azimut.

source: The length in meters of the segment.
sv: Segmentets längd i meter.

source: The geometry in human readable form.
sv: Geometrin i mänskligt läsbar form.

source: geometry
sv: geometri

source: The geometry of the segment in the correct direction.
sv: Segmentets geometri i rätt riktning.

source: For the following exercises only ``vehicle_net`` will be used, but you can test the queries with the other views.
sv: I de följande övningarna används endast ``vehicle_net``, men du kan testa frågorna med de andra vyerna.

source: Additional information handling
sv: Hantering av ytterligare information

source: When the application needs additional information, like the name of the street, ``JOIN`` the results with other tables.
sv: När programmet behöver ytterligare information, t.ex. gatunamnet, kan du "koppla ihop" resultaten med andra tabeller.

source: Exercise 1: Get additional information
sv: Övning 1: Skaffa ytterligare information

source: Route showing names
sv: Namn på vägvisning

source: From |ch7_place_1| to |ch7_place_2|, using OSM identifiers.
sv: Från |ch7_place_1| till |ch7_place_2|, med hjälp av OSM-identifierare.

source: Get the following information:
sv: Få följande information:

source: Solution
sv: Lösning

source: The columns asked (line **2**).
sv: Kolumnerna frågade (rad **2**).

source: Rename ``pgr_dijkstra`` results to application requirements names. (line **4**).
sv: Byt namn på ``pgr_dijkstra`` resultat till namn på applikationskrav. (rad **4**).

source: ``LEFT JOIN`` the results with ``vehicle_net`` to get the additional information. (line **9**)
sv: ``LEFT JOIN`` resultaten med ``vehicle_net`` för att få ytterligare information. (rad **9**)

source: ``LEFT`` to include the row with ``id = -1`` because it does not exist on ``vehicle_net``
sv: ``LEFT`` att inkludera raden med ``id = -1`` eftersom den inte finns på ``vehicle_net``

source: Geometry handling
sv: Geometrihantering

source: From pgRouting point of view, the geometry is part of the additional information, needed on the results for an application. Therefore ``JOIN`` the results with other tables that contain the geometry and for further processing with PostGIS functions.
sv: Ur pgRoutings synvinkel är geometrin en del av den ytterligare information som behövs om resultaten för en applikation. Därför ``JOIN`` resultaten med andra tabeller som innehåller geometrin och för vidare bearbetning med PostGIS-funktioner.

source: Exercise 2: Route geometry (human readable)
sv: Övning 2: Geometri för rutt (läsbar för människor)

source: From |ch7_place_1| to |ch7_place_2|
sv: Från |ch7_place_1| till |ch7_place_2|

source: Route from the |ch7_place_1| to |ch7_place_2|
sv: Rutt från |ch7_place_1| till |ch7_place_2|

source: Additionally to the previous exercise, get the
sv: Utöver den föregående övningen, skaffa

source: geometry ``geom`` in human readable form named as ``route_readable``
sv: geometri ``geom`` i mänskligt läsbar form benämnd ``route_readable``

source: ``WITH`` provides a way to write auxiliary statements in larger queries. It can be thought of as defining temporary tables that exist just for one query.
sv: ``WITH`` är ett sätt att skriva hjälpsatser i större frågor. Det kan liknas vid att definiera temporära tabeller som bara existerar för en fråga.

source: The routing query named ``results`` in a WITH clause. (lines **2** to **5**)
sv: Routningsfrågan med namnet ``results`` i en WITH-sats. (raderna **2** till **5**)

source: The results from the previous exercise. (lines **8** and **9**)
sv: Resultaten från den föregående övningen. (raderna **8** och **9**)

source: For result reading purposes, the result columns from the previous are in a comment. Uncomment to see the complete results for the problem.
sv: För resultatläsning finns resultatkolumnerna från föregående i en kommentar. Ta bort kommentaren för att se de fullständiga resultaten för problemet.

source: The ``geom`` processed with ``ST_AsText`` to get the human readable form. (line **12**)
sv: ``geom`` bearbetas med ``ST_AsText`` för att få den mänskliga läsbara formen. (rad **12**)

source: Renaming the result to ``route_readable``
sv: Byt namn på resultatet till ``route_readable``

source: The ``LEFT JOIN`` with ``vehicle_net``. (line **14**)
sv: Den ``LEFT JOIN`` med ``vehicle_net``. (rad **14**)

source: Exercise 3: Route geometry (binary format)
sv: Övning 3: Ruttgeometri (binärt format)

source: From |ch7_place_1| to |ch7_place_2| showing arrows.
sv: Från |ch7_place_1| till |ch7_place_2| med pilar.

source: ``geom`` in binary format with the name ``route_geom``
sv: ``geom`` i binärt format med namnet ``route_geom``

source: The query from the previous exercise is used
sv: Frågeställningen från föregående övning används

source: The ``SELECT`` clause also contains:
sv: Klausulen ``SELECT`` innehåller också:

source: The ``geom`` including the renaming (line **9**)
sv: ``geom`` inklusive namnändring (rad **9**)

source: Exercise 4: Route geometry directionality
sv: Övning 4: Riktning för väggeometri

source: Visually, with the route displayed with arrows, it can be found that there are arrows that do not match the directionality of the route.
sv: Visuellt, när rutten visas med pilar, kan det konstateras att det finns pilar som inte stämmer överens med ruttens riktning.

source: To have correct directionality, the ending point of a geometry must match the starting point of the next geometry
sv: För att riktningsverkan ska vara korrekt måste slutpunkten för en geometri motsvara startpunkten för nästa geometri

source: Inspecting the detail of the results of `Exercise 2: Route geometry (human readable)`_
sv: Kontrollerar detaljerna i resultatet av `Övning 2: Ruttgeometri (läsbar för alla)`_

source: Rows **59** to **61** do not match that criteria
sv: Raderna **59** till **61** uppfyller inte detta kriterium

source: Fix the directionality of the geometries of the previous exercise
sv: Fixera riktningen för geometrierna i föregående övning

source: ``geom`` in human readable form named as ``route_readable``
sv: ``geom`` i mänskligt läsbar form benämnd ``route_readable``

source: Both columns must have the geometry fixed for directionality.
sv: Båda kolumnerna måste ha geometrin fixerad för riktverkan.

source: To get the correct direction some geometries need to be reversed:
sv: För att få rätt riktning måste vissa geometrier vändas:

source: Reversing a geometry will depend on the ``node`` column of the query to Dijkstra (line **2**)
sv: Att vända en geometri beror på kolumnen ``node`` i frågan till Dijkstra (rad **2**)

source: A conditional ``CASE`` statement that returns the geometry in human readable form:
sv: En villkorlig ``CASE``-sats som returnerar geometrin i läsbar form:

source: Of the geometry when ``node`` is the ``source`` column. (line **11**)
sv: Av geometrin när ``node`` är ``källkolumnen``. (rad **11**)

source: Of the reversed geometry when ``node`` is not the ``source`` column. (line **12**)
sv: Av den omvända geometrin när ``nod`` inte är ``källkolumnen``. (rad **12**)

source: A conditional ``CASE`` statement that returns:
sv: En villkorlig ``CASE``-sats som returnerar:

source: The geometry when ``node`` is the ``source`` column. (line **17**)
sv: Geometrin när ``node`` är ``source``-kolumnen. (rad **17**)

source: The reversed geometry when ``node`` is not the ``source`` column. (line **16**)
sv: Den omvända geometrin när ``node`` inte är ``källkolumnen``. (rad **16**)

source: Inspecting some the problematic rows, the directionality has been fixed.
sv: Vid inspektion av några av de problematiska raderna har riktningen åtgärdats.

source: Exercise 5: Using the geometry
sv: Övning 5: Använda geometrin

source: From |ch7_place_1| to the |ch7_place_2| show azimuth
sv: Från |ch7_place_1| till |ch7_place_2| visa azimut

source: There are many geometry functions in PostGIS, the workshop already covered some of them like ``ST_AsText``, ``ST_Reverse``, ``ST_EndPoint``, etc. This exercise will make use an additional function ``ST_Azimuth``.
sv: Det finns många geometriska funktioner i PostGIS, workshopen har redan behandlat några av dem som ``ST_AsText``, ``ST_Reverse``, ``ST_EndPoint``, etc. Denna övning kommer att använda ytterligare en funktion ``ST_Azimuth``.

source: Modify the query from the previous exercise
sv: Modifiera frågan från föregående övning

source: Additionally obtain the azimuth of the correct geometry.
sv: Dessutom erhålls azimuten för den korrekta geometrin.

source: Because ``vehicle_net`` and the other 2 views are sub graphs of ``ways``, do the ``JOIN`` with ``ways``.
sv: Eftersom ``vehicle_net`` och de andra 2 vyerna är subgrafer av ``ways``, gör ``JOIN`` med ``ways``.

source: Move the query that gets the additional information into the ``WITH`` statement.
sv: Flytta den fråga som ger ytterligare information till ``MED``-satsen.

source: Name it ``additional``. (line **6**)
sv: Namnge den ``additional``. (rad **6**)

source: The ``ways`` table geometry name is ``the_geom``.
sv: Geometrin i tabellen ``ways`` har namnet ``the_geom``.

source: Final ``SELECT`` statements gets:
sv: Slutliga ``SELECT`` uttalanden får:

source: Calculates the azimuth of ``route_geom``. (line **27**)
sv: Beräknar azimut för ``route_geom``. (rad **27**)

source: Creating the Function
sv: Skapa funktionen

source: The following function simplifies (and sets default values) when it calls the shortest path Dijkstra function.
sv: Följande funktion förenklar (och ställer in standardvärden) när den anropar Dijkstra-funktionen för kortaste vägen.

source: pgRouting uses heavely function overloading:
sv: pgRouting använder sig mycket av funktionsöverbelastning:

source: Avoid creating functions with a name of a pgRouting routing function
sv: Undvik att skapa funktioner med ett namn på en pgRouting routing-funktion

source: Avoid the name of a function to start with `pgr_`, `_pgr` or `ST_`
sv: Undvik att namnet på en funktion börjar med `pgr_`, `_pgr` eller `ST_`

source: Exercise 6: Function for an application
sv: Övning 6: Funktion för en applikation

source: Putting all together in a SQL function
sv: Samla allt i en SQL-funktion

source: function name ``wrk_dijkstra``
sv: funktionsnamn ``wrk_dijkstra``

source: Should work for any given view.
sv: Bör fungera för varje given vy.

source: Allow a view as a parameter
sv: Tillåt en vy som en parameter

source: A table can be used if the columns have the correct names.
sv: En tabell kan användas om kolumnerna har rätt namn.

source: ``source`` and ``target`` are in terms of ``osm_id``.
sv: ```source`` och ``target`` är i termer av ``osm_id``.

source: The result should meet the requirements indicated at the beginning of the chapter
sv: Resultatet ska uppfylla de krav som anges i början av kapitlet

source: The signature of the function:
sv: Funktionens signatur:

source: The input parameters are from line **4** to **6**.
sv: Ingångsparametrarna är från rad **4** till **6**.

source: The output columns are from line **7** to **14** (not highlighted).
sv: Utdatakolumnerna är från rad **7** till **14** (ej markerade).

source: The function returns a set. (line **16**)
sv: Funktionen returnerar en uppsättning. (rad **16**)

source: The body of the function:
sv: Funktionens huvuddel:

source: Appending the view name on line **7** in the ``SELECT`` query to ``pgr_dijkstra``.
sv: Lägger till vynamnet på rad **7** i ``SELECT``-frågan till ``pgr_dijkstra``.

source: Using the data to get the route from ``source`` to ``target``. (line **8**)
sv: Använder data för att få rutten från ``källa`` till ``mål``. (rad **8**)

source: The ``JOIN`` with ``ways`` is necessary, as the views are subset of ``ways`` (line **25**)
sv: ``JOIN`` med ``ways`` är nödvändigt, eftersom vyerna är en delmängd av ``ways`` (rad **25**)

source: Exercise 7: Using the function
sv: Övning 7: Använda funktionen

source: Test the function with the three views
sv: Testa funktionen med de tre vyerna

source: From the |ch7_place_1| to the |ch7_place_2| using the OSM identifier
sv: Från |ch7_place_1| till |ch7_place_2| med hjälp av OSM-identifieraren

source: Use the function on the ``SELECT`` statement
sv: Använd funktionen på ``SELECT``-satsen

source: The first parameter changes based on the view to be tested
sv: Den första parametern ändras beroende på vilken vy som ska testas

source: Names of the streets in the route
sv: Namn på gatorna i rutten

source: Total seconds spent in each street
sv: Totalt antal sekunder på varje gata

source: Get all the information of the route
sv: Få all information om rutten

source: Try the function with a combination of the interesting places:
sv: Testa funktionen med en kombination av de intressanta platserna:
