Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/general-intro/introduction.po
Languages: sv

source: Introduction
sv: Introduktion

source: |pgrouting-web| adds routing functionality to |postgis-web|.
sv: |pgrouting-web| lägger till routingfunktionalitet till |postgis-web|.

source: Please see the :doc:`contents <../index>` for full content of FOSS4G Belém workshop. This workshop covers two levels for using pgRouting: `Basic`_ and `Advanced`_.
sv: Se :doc:`innehåll <../index>` för fullständigt innehåll i FOSS4G Belém-workshopen. Denna workshop täcker två nivåer för att använda pgRouting: `Basic`_ och `Advanced`_.

source: Basic
sv: Grundläggande

source: will demonstrate the routing functionality by providing examples using |osm-web| road network data from Belém. Covering topics from how to prepare the data, making routing queries, understanding the results, up to writing a custom 'plpgsql' function that can be integrated with other FOSS tools.
sv: kommer att demonstrera routningsfunktionaliteten genom att ge exempel med hjälp av |osm-web| vägnätsdata från Belém. Vi tar upp ämnen från hur man förbereder data, gör routingfrågor, förstår resultaten till att skriva en anpassad "plpgsql"-funktion som kan integreras med andra FOSS-verktyg.

source: Installing pgRouting.
sv: Installera pgRouting.

source: Creating a routing topology.
sv: Skapa en routningstopologi.

source: Importing |osm-web| road network data.
sv: Importera data från vägnätverk (|osm-web|).

source: Using pgRouting algorithms.
sv: Använda pgRouting-algoritmer.

source: Writing advanced queries.
sv: Skriva avancerade frågor.

source: Writing a custom PostgreSQL stored procedure in `plpgsql`
sv: Skriva en anpassad PostgreSQL lagrad procedur i `plpgsql`

source: Prerequisites
sv: Förutsättningar

source: Workshop level: basic.
sv: Workshopnivå: Grundläggande.

source: Previous knowledge: SQL (PostgreSQL, PostGIS)
sv: Tidigare kunskap: SQL (PostgreSQL, PostGIS)

source: Equipments: `OSGeoLive <https://live.osgeo.org>`__ (17)
sv: Utrustning: `OSGeoLive <https://live.osgeo.org>`__ (17)

source: Advanced
sv: Avancerat

source: pgRouting is an extendible open-source library that provides a variety of tools for graph algorithms, this is not limited to routing vehicles. The advanced section covers several graph problems that can be solved using pgRouting.
sv: pgRouting är ett utbyggbart bibliotek med öppen källkod som tillhandahåller en mängd olika verktyg för grafalgoritmer, detta är inte begränsat till routing för fordon. Den avancerade delen täcker flera grafproblem som kan lösas med pgRouting.

source: Workshop level: Advanced.
sv: Workshopnivå: Avancerad.

source: Previous knowledge: SQL (PostgreSQL, PostGIS, pgRouting)
sv: Tidigare kunskap: SQL (PostgreSQL, PostGIS, pgRouting)

source: Aknowledments
sv: Tack till

source: Sponsored by
sv: Sponsrad av

source: Developers & presenters of FOSS4G Belém workshop:
sv: Utvecklare och presentatörer av FOSS4G Belém-workshopen:

source: *Vicky Vergara* Is a freelance developer from Mexico. She's the core developer of pgRouting project and GSoC Mentor. OSGeo Charter member.
sv: *Vicky Vergara* är en frilansande utvecklare från Mexiko. Hon är kärnutvecklare av pgRouting-projektet och GSoC-mentor. OSGeo Charter-medlem.

source: *Ramón Ríos* Is a freelance developer from Mexico. Lead engenieer for ParkUpFront
sv: *Ramón Ríos* är en frilansande utvecklare från Mexiko. Ledande ingenjör för ParkUpFront

source: Past and present tutors and developers
sv: Tidigare och aktuella handledare och utvecklare

source: Past and present supporters
sv: Tidigare och aktuella supportrar

source: License
sv: Licens

source: This work is licensed under a `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_.
sv: Detta arbete är licensierat under en `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_.

source: Become a sponsor
sv: Bli sponsor
