Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/general-intro/osgeolive.po
Languages: sv

source: All required tools are available on `OSGeoLive <http://live.osgeo.org>`__.
sv: Alla nödvändiga verktyg finns tillgängliga på `OSGeoLive <http://live.osgeo.org>`__.

source: `OSGeoLive Quickstart for Running in a Virtual Machine <https://live.osgeo.org/en/quickstart/virtualization_quickstart.html>`__
sv: `Snabbstart för OSGeoLive för körning i en virtuell maskin <https://live.osgeo.org/en/quickstart/virtualization_quickstart.html>`__

source: `Creating an OSGeoLive Bootable USB flash drive <https://live.osgeo.org/en/quickstart/usb_quickstart.html>`__
sv: `Skapa ett startbart USB-minne för OSGeoLive <https://live.osgeo.org/en/quickstart/usb_quickstart.html>`__

source: Before attending a workshop event, make sure your you can use `OSGeoLive` with either method or :doc:`../appendix/appendix-2` on your computer.
sv: Innan du deltar i ett workshop-evenemang, se till att du kan använda `OSGeoLive` med valfri metod eller :doc:`../appendix/appendix-2` på din dator.

source: This workshop uses OSGeoLive on VirtualBox.
sv: I den här workshopen används OSGeoLive på VirtualBox.

source: Chapter Contents
sv: Kapitelinnehåll

source: Install `VirtualBox <https://www.virtualbox.org/>`__.
sv: Installera `VirtualBox <https://www.virtualbox.org/>`__.

source: This is a general description on how to install VirtualBox. Complete details about installation can be found on the `VirtualBox <https://www.virtualbox.org/>`__ documentation.
sv: Detta är en allmän beskrivning av hur du installerar VirtualBox. Fullständiga detaljer om installationen finns i dokumentationen för VirtualBox <https://www.virtualbox.org/>`__.

source: Linux distributions:
sv: Linux-distributioner:

source: Add the following line to your /etc/apt/sources.list. According to your distribution, replace `<mydist>` with your distribution name.
sv: Lägg till följande rad i din /etc/apt/sources.list. Ersätt `<mydist>` med namnet på din distribution, beroende på vilken distribution du använder.

source: Add the keys:
sv: Lägg till nycklarna:

source: Install Virtual box using:
sv: Installera Virtual box med hjälp av:

source: More detailed and up to date information can be found `here <https://www.virtualbox.org/wiki/Linux_Downloads>`__
sv: Mer detaljerad och aktuell information finns `här <https://www.virtualbox.org/wiki/Linux_Downloads>`__

source: OSGeoLive on a VirtualBox
sv: OSGeoLive på en VirtualBox

source: Download OSGeoLive 17
sv: Ladda ner OSGeoLive 17

source: This installation method corresponds for the ``iso`` distribution of OSGeoLive. For other installations visit `OSgeoLive <https://osgeo.github.io/OSGeoLive-doc/en/index.html>`__
sv: Denna installationsmetod motsvarar ``iso``-distributionen av OSGeoLive. För andra installationer besök `OSgeoLive <https://osgeo.github.io/OSGeoLive-doc/en/index.html>`__

source: The images on this section might not correspond to the VirtualBox or OSGeoLive version installed on your system, but the workflow is similar.
sv: Bilderna i det här avsnittet kanske inte motsvarar den VirtualBox- eller OSGeoLive-version som är installerad på ditt system, men arbetsflödet är liknande.

source: From https://download.osgeo.org/livedvd/releases/17/
sv: Från https://download.osgeo.org/livedvd/releases/17/

source: Download *osgeolive-17-amd64.iso*
sv: Ladda ner *osgeolive-17-amd64.iso*

source: Download is saved on Downloads directory.
sv: Nedladdningen sparas i katalogen Downloads.

source: Create the virtual machine
sv: Skapa den virtuella maskinen

source: Open the Virtual Box
sv: Öppna Virtual Box

source: Click on ``New`` and fill with the following information
sv: Klicka på ``Ny`` och fyll i följande information

source: **Name** OSGeoLive 17
sv: **Namn** OSGeoLive 17

source: **Type** Linux
sv: **Typ** Linux

source: **Version** Ubuntu (64-bit)
sv: **Version** Ubuntu (64-bitars)

source: **Memory size** 4096
sv: **Minnets storlek** 4096

source: **Hard disk** Create a virtual hard disk now
sv: **Hårddisk** Skapa en virtuell hårddisk nu

source: Click on ``Create`` and fill with the following information
sv: Klicka på ``Skapa`` och fyll i följande information

source: **File location** Choose a suitable location for the Virtual Hard Disk
sv: **Filplats** Välj en lämplig plats för den virtuella hårddisken

source: **File size** 10.0GB
sv: **Filstorlek** 10,0 GB

source: **Hard disk file type** VDI (VirtualBox Disk image)
sv: **Filtyp för hårddisk** VDI (VirtualBox Disk image)

source: **Storage on physical hard disk** Dynamically allocated
sv: **Lagring på fysisk hårddisk** Dynamiskt allokerad

source: Install OSGeoLive's ISO
sv: Installera OSGeoLives ISO

source: On Storage it reads:
sv: På Lagring står det:

source: Controller
sv: Kontroller

source: IDE Secondary Device 0
sv: IDE Sekundär enhet 0

source: [Optical Drive] empty
sv: [Optisk enhet] tom

source: Choose ``Storage`` from the virtual box traits and clink on ``Empty``
sv: Välj ``Lagring`` från virtual box egenskaper och klicka på ``Tom``

source: Click on the small disk icon and select **Choose/Create a Virtual Disk**
sv: Klicka på den lilla diskikonen och välj **Välj/skapa en virtuell disk**

source: Navigate to the location where the ISO was installed
sv: Navigera till den plats där ISO-filen installerades

source: Instead of empty, now it has the ISO installed
sv: Istället för att vara tom har den nu ISO installerad

source: The installation now reads:
sv: Installationen har nu följande lydelse:

source: [Optical Drive] osgeolive-10.0alpha3-amd64.iso (4.13 GB)
sv: [Optisk enhet] osgeolive-10.0alpha3-amd64.iso (4,13 GB)

source: Start OSGeoLive
sv: Starta OSGeoLive

source: Click on ``Start`` button, and click on ``capture``, to capture the mouse movements
sv: Klicka på ``Starta``-knappen och klicka på ``Fånga`` för att fånga musrörelserna

source: Click on ``Try or Install Lubuntu``
sv: Klicka på ``Testa eller installera Lubuntu``

source: OSGeoLive's account is ``user`` and password is ``user``
sv: OSGeoLives konto är ``user`` och lösenordet är ``user``

source: After a few seconds OSGeoLive will start
sv: Efter några sekunder kommer OSGeoLive att starta

source: OSGeoLive’s account is ``user`` and password is ``user``
sv: OSGeoLives konto är ``user`` och lösenordet är ``user``

source: Update sources to include postgresql ::
sv: Uppdatera källorna för att inkludera postgresql ::

source: Install PostgrSQL, PostGIS and pgRouting ::
sv: Installera PostgrSQL, PostGIS och pgRouting ::
