Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/interactions/chapter-11.po
Languages: sv

source: OpenLayers Based Routing Interface
sv: OpenLayers-baserat gränssnitt för routning

source: The goal of this chapter is to create a simple web-based user interface to pgRouting based on OpenLayers. The user will be able to choose start and destination locations, and get the route from the start point to the destination point.
sv: Målet med detta kapitel är att skapa ett enkelt webbaserat användargränssnitt till pgRouting baserat på OpenLayers. Användaren kommer att kunna välja start- och destinationsplatser och få rutten från startpunkten till destinationspunkten.

source: The start and destination points are created by the user, with simple clicks on the map. The start and destination coordinates are then sent to the WMS server (GeoServer), as parameters to a WMS ``GetMap`` request. The resulting image is added as an *image* layer to the map.
sv: Start- och destinationspunkterna skapas av användaren med enkla klick på kartan. Start- och destinationskoordinaterna skickas sedan till WMS-servern (GeoServer), som parametrar till en WMS ``GetMap``-begäran. Den resulterande bilden läggs till som ett *image*-lager på kartan.

source: OpenLayers introduction
sv: Introduktion till OpenLayers

source: OpenLayers uses modern JavaScript, and HTML5 technologies such as Canvas and WebGL for the rendering of images/tiles and vectors.
sv: OpenLayers använder modern JavaScript- och HTML5-teknik som Canvas och WebGL för rendering av bilder/tiles och vektorer.

source: Creating an OpenLayers map in a web page involves creating a *map* object, which is an instance of the ``ol.Map`` class. Then, data layers and controls can be added to that map object.
sv: Att skapa en OpenLayers-karta på en webbsida innebär att man skapar ett *map*-objekt, som är en instans av klassen ``ol.Map``. Sedan kan datalager och kontroller läggas till i det kartobjektet.

source: The center and resolution (zoom level) of the map are controlled through the *view* object. Unless other mapping libraries, the view is separated from the map; one advantage is to allow multiple maps to share the same view.
sv: Kartans mittpunkt och upplösning (zoomnivå) styrs genom objektet *view*. Till skillnad från andra mappningsbibliotek är vyn separerad från kartan; en fördel är att flera kartor kan dela samma vy.

source: OpenLayers features three renderers: the *Canvas* renderer, the *WebGL* renderer, and the *DOM* renderer. Currently, the most capable renderer is Canvas. In particular the Canvas renderer supports vector layers, while the other two don't. Canvas is the default renderer, and the renderer used in this workshop.
sv: OpenLayers har tre renderare: *Canvas*-renderaren, *WebGL*-renderaren och *DOM*-renderaren. För närvarande är Canvas den mest kapabla renderaren. Framför allt stöder Canvas-renderaren vektorlager, medan de andra två inte gör det. Canvas är standardrenderaren och den renderare som används i den här workshopen.

source: Creating a minimal map
sv: Skapa en minimal karta

source: Let's create our first OpenLayers map: open a text editor and copy this code into a file named ``ol.html``. You can save this file on the ``Desktop`` and open it with a web browser.
sv: Låt oss skapa vår första OpenLayers-karta: öppna en textredigerare och kopiera den här koden till en fil med namnet ``ol.html``. Du kan spara den här filen på "Skrivbordet" och öppna den med en webbläsare.

source: This workshop assumes, that you use OSGeoLive, which includes the OpenLayers Javascript library accessible under the following URL: http://localhost/openlayers/dist/ If you don't use OSGeo Live for this workshop, you need to adjust the URL to OpenLayers Javascript and CSS file.
sv: Denna workshop förutsätter att du använder OSGeoLive, som innehåller OpenLayers Javascript-bibliotek som är tillgängligt under följande URL: http://localhost/openlayers/dist/ Om du inte använder OSGeo Live för den här workshopen måste du justera webbadressen till OpenLayers Javascript- och CSS-fil.

source: This web page includes a simple map with an OpenStreetMap layer and center to a predifined location. There is no routing-related code for now; just a simple map with stantard navigation tools.
sv: Den här webbsidan innehåller en enkel karta med ett OpenStreetMap-lager och en centrering till en förutbestämd plats. Det finns ingen routingrelaterad kod för tillfället; bara en enkel karta med standardnavigeringsverktyg.

source: Line by line we have:
sv: Linje för linje har vi det:

source: Line 6: include the default OpenLayers CSS file.
sv: Rad 6: inkludera standard CSS-filen för OpenLayers.

source: Line 7 to Line 12: CSS rules to give dimensions to the map DOM element.
sv: Rad 7 till rad 12: CSS-regler för att ge dimensioner åt kartans DOM-element.

source: Line 15: add a div element for the map. The element's identifier is ``map``.
sv: Rad 15: lägg till ett div-element för kartan. Elementets identifierare är ``map``.

source: Line 16: load the OpenLayers library code. Functions and classes in the ``ol`` namespace come from there.
sv: Rad 16: ladda koden för OpenLayers-biblioteket. Funktioner och klasser i namnrymden ``ol`` kommer därifrån.

source: Line 18 to Line 29: the JavaScript code specific to that example.
sv: Rad 18 till rad 29: den JavaScript-kod som är specifik för det exemplet.

source: Let's have a closer look at the code that create the OpenLayers code:
sv: Låt oss ta en närmare titt på koden som skapar OpenLayers-koden:

source: This code creates an ``ol.Map`` instance whose ``target`` is the ``map`` DOM element in the HTML page. The map is configured with a *tile layer*, itself configured with an OpenStreetMap *source*. The map is also configured with a *view* instance (of the ``ol.View`` class) with predefined values for the *center* and the *zoom* level.
sv: Denna kod skapar en instans av ``ol.Map`` vars ``mål`` är DOM-elementet ``map`` på HTML-sidan. Kartan konfigureras med ett *tile layer*, som i sin tur konfigureras med en OpenStreetMap *source*. Kartan är också konfigurerad med en *view*-instans (av klassen ``ol.View``) med fördefinierade värden för *center* och *zoom*-nivån.

source: WMS GET parameters
sv: WMS GET-parametrar

source: Add this code after the creation of the map:
sv: Lägg till den här koden efter att kartan har skapats:

source: The ``params`` object holds the WMS GET parameters that will be sent to GeoServer. Here we set the values that will never change: the layer name and the output format.
sv: Objektet ``params`` innehåller de WMS GET-parametrar som ska skickas till GeoServer. Här ställer vi in de värden som aldrig kommer att ändras: skiktnamnet och utdataformatet.

source: Select "start" and "destination"
sv: Välj "start" och "destination"

source: We now want to allow the user to add the start and destination positions by clicking on the map. Add the following code for that:
sv: Vi vill nu låta användaren lägga till start- och destinationspositionerna genom att klicka på kartan. Lägg till följande kod för detta:

source: That code creates two vector features, one for the "start" position and one for the "destination" position. These features are empty for now – they do not include a geometry.
sv: Den koden skapar två vektorfunktioner, en för "start"-positionen och en för "destination"-positionen. Dessa funktioner är tomma än så länge - de innehåller ingen geometri.

source: The code also creates a vector layer, with the "start" and "destination" features added to it. It also adds the vector layer to the map, using the map's ``addLayer`` method.
sv: Koden skapar också ett vektorlager med funktionerna "start" och "destination" tillagda. Den lägger också till vektorlagret på kartan med hjälp av kartans metod ``addLayer``.

source: Now add the following code:
sv: Lägg nu till följande kod:

source: This code registers a listener function for the map ``click`` event. This means that OpenLayers will call that function each time a click is detected on the map.
sv: Denna kod registrerar en lyssnarfunktion för karthändelsen ``click``. Detta innebär att OpenLayers kommer att anropa den funktionen varje gång ett klick upptäcks på kartan.

source: The event object passed to the listener function includes a ``coordinate`` property that indicates the geographical location of the click. That coordinate is used to create a *point* geometry for the "start" and "destination" features.
sv: Det händelseobjekt som skickas till lyssnarfunktionen innehåller en "koordinat"-egenskap som anger den geografiska platsen för klicket. Denna koordinat används för att skapa en *punkt*-geometri för funktionerna "start" och "destination".

source: Once we have the start and destination points (after two clicks); the two pairs of coordinates are transformed from the map projection (``EPSG:3857``) into the server projection (``EPSG:4326``) using the ``transform`` function.
sv: När vi har start- och destinationspunkterna (efter två klick) omvandlas de två koordinatparen från kartprojektionen (``EPSG:3857``) till serverprojektionen (``EPSG:4326``) med hjälp av funktionen ``transform``.

source: The ``viewparams`` property is then set on WMS GET parameters object. The value of this property has a special meaning: GeoServer will substitute the value before executing the SQL query for the layer. For example, if we have:
sv: Egenskapen ``viewparams`` sätts sedan på WMS GET parameters-objektet. Värdet på denna egenskap har en speciell betydelse: GeoServer kommer att ersätta värdet innan SQL-frågan för skiktet körs. Till exempel, om vi har:

source: And ``viewparams`` is ``viewparams=min:20;max:120`` then the SQL query sent to PostGIS will be:
sv: Och ``viewparams`` är ``viewparams=min:20;max:120`` då kommer SQL-frågan som skickas till PostGIS att vara:

source: Finally, a new OpenLayers WMS layer is created and added to the map, the param object is passed to it.
sv: Slutligen skapas ett nytt OpenLayers WMS-lager som läggs till på kartan, och param-objektet skickas till det.

source: Clear the results
sv: Rensa resultaten

source: Add this after the map ``div`` in the HTML page:
sv: Lägg till detta efter kartan ``div`` på HTML-sidan:

source: This creates a button to we will use to allow the user to clear the routing points and start a new routing query.
sv: Detta skapar en knapp som vi kommer att använda för att låta användaren rensa routningspunkterna och starta en ny routningsfråga.

source: Now add the following to the JavaScript code:
sv: Lägg nu till följande i JavaScript-koden:

source: When the button is clicked, this function passed to ``addEventListener`` is executed. That function resets the "start" and "destination" features and remove the routing result layer from the map.
sv: När du klickar på knappen utförs den här funktionen som skickas till ``addEventListener``. Funktionen återställer funktionerna "start" och "destination" och tar bort skiktet med routningsresultat från kartan.

source: Summary (full example)
sv: Sammanfattning (fullständigt exempel)

source: Now copy the following final application code into a file, accessible by a webserver, such as Apache or Nginx for example:
sv: Kopiera nu följande slutliga programkod till en fil som kan nås av en webbserver, t.ex. Apache eller Nginx:
