Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/interactions/chapter-10.po
Languages: sv

source: WMS server with GeoServer
sv: WMS-server med GeoServer

source: Now that we have a pl/pgsql wrapper, we will make it available as a WMS layer using `GeoServer <https://geoserver.org/>`_.
sv: Nu när vi har en pl/pgsql-wrapper ska vi göra den tillgänglig som ett WMS-lager med hjälp av `GeoServer <https://geoserver.org/>`_.

source: The installation of GeoServer is out of the scope of this workshop, but if you're using the `OSGeoLive <https://live.osgeo.org>`_ for this workshop then you have GeoServer installed already.
sv: Installationen av GeoServer ligger utanför ramen för den här workshopen, men om du använder `OSGeoLive <https://live.osgeo.org>`_ för den här workshopen har du redan GeoServer installerat.

source: Connect to the administration page
sv: Anslut till administrationssidan

source: In order to create the WMS layer, we need to connect to the administration interface of GeoServer. On `OSGeoLive <https://live.osgeo.org>`_ Desktop, open the *Applications* menu on the desktop and then *Geospatial* > *Web Services* > *GeoServer* > *Start GeoServer*.
sv: För att kunna skapa WMS-lagret måste vi ansluta till administrationsgränssnittet för GeoServer. På `OSGeoLive <https://live.osgeo.org>`_ Desktop öppnar du menyn *Applications* på skrivbordet och sedan *Geospatial* > *Web Services* > *GeoServer* > *Start GeoServer*.

source: Once the server is up and running, open the `administration page <http://localhost:8082/geoserver/web>`_ in your browser, click the *Login* button, and enter the GeoServer admin credentials:
sv: När servern är igång öppnar du administrationssidan <http://localhost:8082/geoserver/web>`_ i din webbläsare, klickar på knappen *Login* och anger administratörsuppgifterna för GeoServer:

source: Username
sv: Användarnamn

source: Password
sv: Lösenord

source: Create the layer
sv: Skapa lagret

source: Now that your are logged in as an administrator you can create the WMS layer. In GeoServer terminology you will create an SQL View (see the `official documentation <https://docs.geoserver.org/latest/en/user/data/database/sqlview.html>`_ for more info).
sv: Nu när du är inloggad som administratör kan du skapa WMS-lagret. I GeoServer-terminologi kommer du att skapa en SQL-vy (se den officiella dokumentationen <https://docs.geoserver.org/latest/en/user/data/database/sqlview.html>`_ för mer information).

source: The first thing to do is to create a new **Workspace** for pgrouting: in the left menu of the page, inside the *Data* section, click *Workspaces* and then *Add new workspace*.
sv: Det första du ska göra är att skapa en ny **Workspace** för pgrouting: i den vänstra menyn på sidan, i avsnittet *Data*, klickar du på *Workspaces* och sedan på *Add new workspace*.

source: Fill the form with:
sv: Fyll i formuläret med:

source: Name
sv: Namn

source: Namespace URI
sv: Namnrymds-URI

source: And press the ``submit`` button.
sv: Tryck sedan på knappen "Skicka".

source: Next step: create a new **Store** linked to the workspace. Still in the left menu, click *Stores* and then *Add new Store*. Here you can choose the type of data source to configure. Choose *PostGIS*.
sv: Nästa steg: skapa en ny **Store** kopplad till arbetsytan. Klicka på *Stores* i vänstermenyn och sedan på *Add new Store*. Här kan du välja vilken typ av datakälla som ska konfigureras. Välj *PostGIS*.

source: Basic Store Info:
sv: Grundläggande butiksinformation:

source: Workspace
sv: Arbetsområde

source: Data Source
sv: Datakälla

source: Connection Parameters:
sv: Parametrar för anslutning:

source: host
sv: värd

source: database
sv: databas

source: user
sv: användare

source: password
sv: lösenord

source: The rest of the values can be left untouched.
sv: Resten av värdena kan lämnas orörda.

source: Finally, your next task is to create the **Layer**. Click the *Layers* menu and then *Add a new resource*. Select the newly created workspace and store pair: ``pgrouting:pgrouting``.
sv: Slutligen är nästa uppgift att skapa **Lager**. Klicka på menyn *Lager* och sedan på *Lägg till en ny resurs*. Välj den nyskapade arbetsytan och lagringsparet: ``pgrouting:pgrouting``.

source: Inside the text, click *Configure new SQL view*.
sv: Klicka på *Konfigurera ny SQL-vy* inne i texten.

source: Name the view ``pgrouting`` and fill the *SQL statement* with:
sv: Namnge vyn ``pgrouting`` och fyll i *SQL-uttalandet* med:

source: In the *SQL view parameters*, click *Guess parameters from SQL*; the list displayed represents the parameters from the SQL above.
sv: I *SQL view parameters* klickar du på *Guess parameters from SQL*; listan som visas representerar parametrarna från SQL ovan.

source: For each parameter:
sv: För varje parameter:

source: Set the default value to: `0`
sv: Ställ in standardvärdet till: `0`

source: Change the validation regular expression to ``^-?[\d.]+$``
sv: Ändra det reguljära valideringsuttrycket till ``^-?[\d.]+$``

source: The regular expression will only match numbers.
sv: Det reguljära uttrycket matchar bara siffror.

source: In the *Attributes* list:
sv: I listan *Attributes*:

source: Hit *Refresh*, one attribute should appear (called *st_makeline*)
sv: Tryck på *Uppdatera*, ett attribut ska visas (kallas *st_makeline*)

source: Change the type to ``LineString`` and the SRID of the geometry column from ``-1`` to ``4326``
sv: Ändra typen till ``LineString`` och SRID för geometrikolumnen från ``-1`` till ``4326``

source: Save the form.
sv: Spara formuläret.

source: Finally, we need to setup the rest of the layer.
sv: Slutligen måste vi ställa in resten av lagret.

source: The only thing to do in this screen is to make sure that the coordinate reference system is correct: the geometries in the database are in ``EPSG:4326`` but we want to display them in `EPSG:3857` because the OpenLayers map where the layer will be dispayed is in this projection.
sv: Det enda du behöver göra på den här skärmen är att se till att koordinatreferenssystemet är korrekt: geometrierna i databasen är i ``EPSG:4326`` men vi vill visa dem i `EPSG:3857` eftersom OpenLayers-kartan där lagret ska läggas ut är i denna projektion.

source: Scroll down to the *coordinate reference system* section and change the **Declared SRS** to ``EPSG:3857`` and the **SRS handling** to ``Reproject native to declared``.
sv: Bläddra ner till avsnittet *koordinatreferenssystem* och ändra **Declared SRS** till ``EPSG:3857`` och **SRS-hantering** till ``Reproject native to declared``.

source: Click the *Compute from data* and *Compute from native bounds* link to automatically set the layer bounds. Click the *Save* at the bottom of the page to create the layer.
sv: Klicka på länkarna *Beräkna från data* och *Beräkna från ursprungliga gränser* för att automatiskt ställa in skiktgränserna. Klicka på *Spara* längst ned på sidan för att skapa lagret.
