Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/advanced/chapter-12.po
Languages: sv

source: Create a Network Topology
sv: Skapa en nätverkstopologi

source: :doc:`osm2pgrouting <../appendix/appendix-3>` is a convenient tool, and its focus to work on OpenStreetMap data. There are several cases where :doc:`osm2pgrouting <../appendix/appendix-3>` can't be used. Some network data already comes with a network topology that can be used with pgRouting out-of-the-box. Often network data is stored in Shape file format (``.shp``) and we can use PostGIS' ``shp2pgsql`` converter to import the data into a PostgreSQL database.
sv: :doc:`osm2pgrouting <../appendix/appendix-3>` är ett bekvämt verktyg, och dess fokus är att arbeta med OpenStreetMap-data. Det finns flera fall där :doc:`osm2pgrouting <../appendix/appendix-3>` inte kan användas. Vissa nätverksdata levereras redan med en nätverkstopologi som kan användas med pgRouting out-of-the-box. Ofta lagras nätverksdata i Shape-filformat (``.shp``) och vi kan använda PostGIS '``shp2pgsql``-omvandlare för att importera data till en PostgreSQL-databas.

source: But what to do then?
sv: Men vad ska man göra då?

source: In this chapter you will learn how to create a basic `Routing Network Topology` from a network data that does not have a routing Topology create the minimum attributes needed the `Routing Network Topology`.
sv: I det här kapitlet lär du dig att skapa en grundläggande `Routing Network Topology` från nätverksdata som inte har någon routing Topology skapa de minimiattribut som behövs för `Routing Network Topology`.

source: Chapter contents
sv: Kapitelinnehåll

source: Load network data
sv: Ladda nätverksdata

source: At first we will load OpenStreetMap sample data with osm2pgsql.
sv: Först laddar vi OpenStreetMap exempeldata med osm2pgsql.

source: Let's see which tables have been created:
sv: Låt oss se vilka tabeller som har skapats:

source: Run: ``psql -U user -d osm_data -c "\d"``
sv: Kör: ``psql -U user -d osm_data -c "\d"``

source: The table containing the road network data has the name ``planet_osm_roads``. It consists of large amount of attributes.
sv: Tabellen som innehåller uppgifter om vägnätet har namnet ``planet_osm_roads``. Den består av en stor mängd attribut.

source: Run: ``psql -U user -d osm_data -c "\d planet_osm_roads"``
sv: Kör: ``psql -U user -d osm_data -c "\d planet_osm_roads"``

source: It is common that road network data provides at least the following information:
sv: Det är vanligt att uppgifter om vägnätet innehåller åtminstone följande information:

source: Road link ID (gid)
sv: ID för väglänk (gid)

source: Road class (class_id)
sv: Vägklass (klass_id)

source: Road link length (length)
sv: Längd på väglänk (längd)

source: Road name (name)
sv: Vägens namn (namn)

source: Road geometry (the_geom)
sv: Väggeometri (the_geom)

source: This allows to display the road network as a PostGIS layer in GIS software, for example in QGIS. Though it is not sufficient for routing, because it doesn't contain network topology information.
sv: Detta gör det möjligt att visa vägnätet som ett PostGIS-lager i GIS-program, till exempel i QGIS. Det är dock inte tillräckligt för routing, eftersom det inte innehåller information om nätverkstopologin.

source: The next steps will use the PostgreSQL command line tool.
sv: Nästa steg kommer att använda kommandoradsverktyget PostgreSQL.

source: Create a Routing Network Topology
sv: Skapa en topologi för ett routningsnätverk

source: Having your data imported into a PostgreSQL database might require one more step for pgRouting.
sv: Att ha dina data importerade till en PostgreSQL-databas kan kräva ytterligare ett steg för pgRouting.

source: Make sure that your data provides a correct `Routing Network Topology`, which consists of information about source and target identifiers for each road link. The results above, show that the network topology does not have any source and target information.
sv: Se till att dina data ger en korrekt `Routing Network Topology`, som består av information om käll- och målidentifierare för varje väglänk. Resultaten ovan visar att nätverkstopologin inte har någon information om källa och mål.

source: Creation of the `Routing Network Topology` is necessary.
sv: Skapande av `Routing Network Topology` är nödvändigt.

source: PostGIS topology is not suitable for Routing.
sv: PostGIS-topologin är inte lämplig för Routing.

source: pgRouting provides a general way for creating the `Routing Network Topology` with the ``pgr_createTopology`` function.
sv: pgRouting tillhandahåller ett allmänt sätt att skapa `Routing Network Topology` med funktionen ``pgr_createTopology``.

source: This function:
sv: Denna funktion:

source: Assigns a ``source`` and a ``target`` identifiers to each road link
sv: Tilldelar en ``käll`` och en ``mål`` identifiering till varje väglänk

source: It can logically "snap" nearby vertices within a certain tolerance by assigning the same identifier.
sv: Den kan logiskt "fästa" närliggande hörn inom en viss tolerans genom att tilldela dem samma identifierare.

source: Creates a vertices table related to it.
sv: Skapar en vertices-tabell som är relaterad till den.

source: Creates the basic indices.
sv: Skapar de grundläggande indexen.

source: For additional information see `pgr_createTopology <https://docs.pgrouting.org/latest/en/pgr_createTopology.html>`_.
sv: För ytterligare information se `pgr_createTopology <https://docs.pgrouting.org/latest/en/pgr_createTopology.html>`_.

source: First add source and target column, then run the ``pgr_createTopology`` function ... and wait.
sv: Lägg först till käll- och målkolumn, kör sedan funktionen ``pgr_createTopology`` ... och vänta.

source: Depending on the network size this process may take from minutes to hours.
sv: Beroende på nätverkets storlek kan denna process ta från några minuter till flera timmar.

source: Progress indicator can be read with PostgreSQL NOTICE
sv: Framstegsindikator kan läsas med PostgreSQL NOTICE

source: It will also require enough memory (RAM or SWAP partition) to store temporary data.
sv: Det krävs också tillräckligt med minne (RAM eller SWAP-partition) för att lagra tillfälliga data.

source: The dimension of the tolerance parameter depends on your data projection. Usually it's either "degrees" or "meters". In our example the geometry data projection to determine the tolerance:
sv: Toleransparameterns dimension beror på din dataprojektion. Vanligtvis är det antingen "grader" eller "meter". I vårt exempel används geometridataprojektionen för att bestämma toleransen:

source: Based on this result the tolerance will be 0.00001
sv: Baserat på detta resultat kommer toleransen att vara 0,00001

source: Verify the Routing Network Topology
sv: Verifiera topologin för routningsnätverket

source: To verify that there is a basic `Routing Network Topology`:
sv: För att verifiera att det finns en grundläggande `Routing Network Topology`:

source: Also a new table containing the vertices information was created:
sv: Dessutom skapades en ny tabell som innehåller information om topparna:

source: ``id`` is the vertex identifier
sv: ``id`` är vertexidentifieraren

source: ``the_geom`` is the geometry considered for that particular vertex identifier.
sv: ``the_geom`` är den geometri som beaktas för den specifika vertexidentifieraren.

source: ``source`` and ``target`` from the ``planet_osm_roads`` correspond to an ``id`` in ``planet_osm_roads_vertices_pgr`` table
sv: ``källa`` och ``mål`` från ``planet_osm_roads`` motsvarar ett ``id`` i ``planet_osm_roads_vertices_pgr``-tabellen

source: Additional columns are for analyzing the topology.
sv: Ytterligare kolumner är till för att analysera topologin.

source: Now we are ready for our first routing query with `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__ or any other pgRouting query.
sv: Nu är vi redo för vår första routingfråga med `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__ eller någon annan pgRouting-fråga.

source: Analyze and Adjust the Routing Network Topology
sv: Analysera och justera topologin för routningsnätverket

source: Analyzing the topology with `pgr_analyzeGraph <https://docs.pgrouting.org/latest/en/pgr_analyzeGraph.html>`_:
sv: Analysera topologin med `pgr_analyzeGraph <https://docs.pgrouting.org/latest/en/pgr_analyzeGraph.html>`_:

source: Adjusting the topology is not an easy task:
sv: Att justera topologin är inte en lätt uppgift:

source: Is an isolated segment an error in the data?
sv: Är ett isolerat segment ett fel i datan?

source: Is an isolated segment because its on the edge of the bounding box?
sv: Är det ett isolerat segment eftersom det ligger på kanten av den avgränsande rutan?

source: Do the potential gaps found near dead ends because the tolerance was too small?
sv: Beror de potentiella luckor som finns nära återvändsgränder på att toleransen var för liten?

source: Are the intersections real intersections and need to be nodded?
sv: Är korsningarna riktiga korsningar och behöver de nickas till?

source: Are the intersections bridges or tunnels and do not need to be nodded?
sv: Är korsningarna broar eller tunnlar och behöver inte nickas?

source: Depending on the application some adjustments need to be made.
sv: Beroende på tillämpning måste vissa justeringar göras.

source: Some `topology manipulation <https://docs.pgrouting.org/latest/en/topology-functions.html>`_ functions help to detect and fix some of the topological errors in the data.
sv: Vissa funktioner för topologimanipulation <https://docs.pgrouting.org/latest/en/topology-functions.html>`_ hjälper till att upptäcka och åtgärda vissa topologiska fel i data.
