Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/data.po
Languages: sv

source: Data for Sustainable Development Goals
sv: Data för målen för hållbar utveckling

source: To be able to use pgRouting, data has to be imported into a database. This chapter will use ``osm2pgrouting`` to get that the data from OpenStreetMaps(OSM). This data will be used for exercises in further chapters.
sv: För att kunna använda pgRouting måste data importeras till en databas. I detta kapitel kommer ``osm2pgrouting`` att användas för att hämta data från OpenStreetMaps(OSM). Dessa data kommer att användas för övningar i kommande kapitel.

source: Chapter Contents
sv: Kapitelinnehåll

source: Work Directory for pgRouting data manipulation
sv: Arbetskatalog för manipulering av pgRouting-data

source: Mumbai database
sv: Databas för Mumbai

source: pgRouting is pre-installed as an extension which requires:
sv: pgRouting är förinstallerat som ett tillägg som kräver:

source: Supported PostgreSQL version
sv: PostgreSQL-version som stöds

source: Supported PostGIS version
sv: Version av PostGIS som stöds

source: These requirements are met on OSGeoLive. When the required software is installed, open a terminal window by pressing ``ctrl-alt-t`` and follow the instructions. Information about installing OSGeoLive can be found in :doc:`../general-intro/osgeolive` of this workshop.
sv: Dessa krav uppfylls på OSGeoLive. När den programvara som krävs är installerad, öppna ett terminalfönster genom att trycka på ``ctrl-alt-t`` och följ instruktionerna. Information om hur du installerar OSGeoLive finns i :doc:`../general-intro/osgeolive` i denna workshop.

source: If you don't have pgRouting installed. You can find the installation procedure at this `link <https://docs.pgrouting.org/latest/en/pgRouting-installation.html>`__
sv: Om du inte har pgRouting installerat. Du kan hitta installationsproceduren på den här länken <https://docs.pgrouting.org/latest/en/pgRouting-installation.html>`__

source: Create Mumbai database compatible with pgRouting
sv: Skapa en Mumbai-databas som är kompatibel med pgRouting

source: Use the following command to create ``mumbai`` database
sv: Använd följande kommando för att skapa databasen ``mumbai``

source: To connect to the database do the following
sv: Gör så här för att ansluta till databasen

source: After connecting to the database, first step is to create ``EXTENSION`` to enable pgRouting and PostGIS in the database. Then add the ``SCHEMA`` for each table.
sv: Efter att ha anslutit till databasen är första steget att skapa ``EXTENSION`` för att aktivera pgRouting och PostGIS i databasen. Lägg sedan till ``SCHEMA`` för varje tabell.

source: Get the Mumbai Data
sv: Hämta data från Mumbai

source: The pgRouting workshop will make use of OpenStreetMap data of an area in Mumbai City. The instructions for downloading the data are given below.
sv: Workshopen om pgRouting kommer att använda OpenStreetMap-data för ett område i Mumbai City. Instruktionerna för att ladda ner data finns nedan.

source: Downloading Mumbai data from OSGeo
sv: Nedladdning av Mumbai-data från OSGeo

source: The following command is used to download the snapshot of the Mumbai area data used in this workshop, using the download service of OSGeo.
sv: Följande kommando används för att ladda ner den ögonblicksbild av Mumbai-områdets data som används i denna workshop, med hjälp av OSGeos nedladdningstjänst.

source: The Mumbai data for this workshop depends on this `snapshot <http://download.osgeo.org/pgrouting/workshops/mumbai.osm.bz2>`__.
sv: Mumbai-data för den här workshopen är beroende av denna `snapshot <http://download.osgeo.org/pgrouting/workshops/mumbai.osm.bz2>`__.

source: Downloading Mumbai data from OpenStreetMap (OSM)
sv: Data för Mumbai hämtas från OpenStreetMap (OSM)

source: The following command is used to download the OpenStreetMap data of the area in Mumbai, India.
sv: Följande kommando används för att ladda ner OpenStreetMap-data för området i Mumbai, Indien.

source: OpenStreetMap data changes on a day to day basis, therefore if this data is used, the results might change and some queries might need adjustments. The command was used to take the snapshot of the data on June 2021.
sv: OpenStreetMap-data ändras från dag till dag, så om dessa data används kan resultaten ändras och vissa frågor kan behöva justeras. Kommandot användes för att ta en ögonblicksbild av uppgifterna i juni 2021.

source: Upload Mumbai data to the database
sv: Ladda upp Mumbai-data till databasen

source: The next step is to run ``osm2pgrouting`` converter, which is a command line tool that inserts the data in the database, "ready" to be used with pgRouting. See :doc:`../appendix/appendix-3` for additional information about ``osm2pgrouting``.
sv: Nästa steg är att köra ``osm2pgrouting`` converter, som är ett kommandoradsverktyg som infogar data i databasen, "redo" att användas med pgRouting. Se :doc:`../appendix/appendix-3` för ytterligare information om ``osm2pgrouting``.

source: For this step the following is used:
sv: För detta steg används följande:

source: ``mumbai_buildings.xml`` and ``mumbai_roads.xml`` configuration files for osm2pgrouting.
sv: konfigurationsfilerna ``mumbai_buildings.xml`` och ``mumbai_roads.xml`` för osm2pgrouting.

source: ``~/Desktop/workshop/mumbai.osm`` - OSM data from the previous step
sv: ``~/Desktop/workshop/mumbai.osm`` - OSM-data från föregående steg

source: ``mumbai`` database.
sv: ``mumbai``-databasen.

source: Contents of the configuration files are given in the `Appendix`_. Create a XML file using these contents and save it into the root directory ``~/Desktop/workshop``.
sv: Innehållet i konfigurationsfilerna finns i `Appendix`_. Skapa en XML-fil med hjälp av detta innehåll och spara den i rotkatalogen ``~/Desktop/workshop``.

source: Open a terminal window by ``ctrl-alt-t`` and move to the workshop directory by ``cd ~/Desktop/workshop``. The following ``osm2pgrouting`` command will be used to convert the osm files to pgRouting friendly format which we will use for further exercises.
sv: Öppna ett terminalfönster med ``ctrl-alt-t`` och flytta till workshopkatalogen med ``cd ~/Desktop/workshop``. Följande kommando ``osm2pgrouting`` kommer att användas för att konvertera osm-filerna till pgRouting-vänligt format som vi kommer att använda för ytterligare övningar.

source: Importing Mumbai Roads
sv: Import av Mumbai Roads

source: The following ``osm2pgrouting`` command will be used to import the Roads from OpenStreetMaps file to pgRouting database which we will use for further exercises.
sv: Följande kommando ``osm2pgrouting`` kommer att användas för att importera vägarna från OpenStreetMaps-filen till pgRouting-databasen som vi kommer att använda för ytterligare övningar.

source: Depending on the osm2pgrouting version `-W password` is needed
sv: Beroende på osm2pgrouting-versionen behövs `-W lösenord`

source: Output:
sv: Utdata:

source: Importing Mumbai Buildings
sv: Import av Mumbai-byggnader

source: Similar to Roads, ``osm2pgrouting`` command will be used to import the Buildings from OpenStreetMaps file to pgRouting database which we will use for further exercises.
sv: I likhet med Roads kommer kommandot ``osm2pgrouting`` att användas för att importera Buildings från OpenStreetMaps-filen till pgRouting-databasen som vi kommer att använda för ytterligare övningar.

source: To connect to the database, type the following in the terminal.
sv: För att ansluta till databasen skriver du följande i terminalen.

source: Bangladesh database
sv: Databas för Bangladesh

source: Now download the data for an area in Bangladesh by following the same steps like that of Mumbai.
sv: Hämta nu data för ett område i Bangladesh genom att följa samma steg som för Mumbai.

source: Create Bangladesh area database compatible with pgRouting
sv: Skapa en databas för Bangladesh-området som är kompatibel med pgRouting

source: Use the following command to create ``bangladesh`` database
sv: Använd följande kommando för att skapa databasen ``bangladesh``

source: Get the Bangladesh Data
sv: Hämta data från Bangladesh

source: Downloading Bangladesh data from OSGeo
sv: Data från Bangladesh hämtas från OSGeo

source: The following command is used to download the snapshot of the Bangladesh area data used in this workshop, using the download service of OSGeo.
sv: Följande kommando används för att ladda ner ögonblicksbilden av Bangladesh-områdesdata som används i denna workshop, med hjälp av nedladdningstjänsten för OSGeo.

source: The Bangladesh data for this workshop depends on this `snapshot <http://download.osgeo.org/pgrouting/workshops/bangladesh.osm.bz2>`__.
sv: Bangladesh-data för denna workshop är beroende av denna `snapshot <http://download.osgeo.org/pgrouting/workshops/bangladesh.osm.bz2>`__.

source: Downloading Bangladesh data from OpenStreetMap
sv: Data om Bangladesh hämtas från OpenStreetMap

source: The following command is used to download the OSM data of the area in Munshigang, Bangladesh.
sv: Följande kommando används för att ladda ner OSM-data för området i Munshigang, Bangladesh.

source: Upload Bangladesh data to the database
sv: Ladda upp Bangladesh-data till databasen

source: ``waterways.xml`` configuration file
sv: konfigurationsfilen ``waterways.xml``

source: ``~/Desktop/workshop/bangladesh.osm`` - OSM data from the previous step
sv: ``~/Desktop/workshop/bangladesh.osm`` - OSM-data från föregående steg

source: ``bangladesh`` database
sv: databasen ``Bangladesh``

source: Open a terminal window by ``ctrl-alt-t`` and move to the workshop directory by ``cd ~/Desktop/workshop``.
sv: Öppna ett terminalfönster med ``ctrl-alt-t`` och flytta till workshopkatalogen med ``cd ~/Desktop/workshop``.

source: Importing Bangladesh Waterways
sv: Import av vattenvägar i Bangladesh

source: The following ``osm2pgrouting`` command will be used to import the Waterways from OpenStreetMaps file to pgRouting database which we will use for further exercises.
sv: Följande ``osm2pgrouting``-kommando kommer att användas för att importera vattenvägarna från OpenStreetMaps-filen till pgRouting-databasen som vi kommer att använda för ytterligare övningar.

source: Configuration information for Buildings
sv: Konfigurationsinformation för byggnader

source: Configuration information for Waterways
sv: Konfigurationsinformation för vattenvägar
