Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/introduction.po
Languages: sv

source: Achieving Sustainable Development Goals with pgRouting
sv: Uppnå målen för hållbar utveckling med pgRouting

source: History
sv: Historik

source: The `UN OpenGIS initiative <http://unopengis.org/unopengis/main/main.php>`__ along with `OSGeo Foundation <https://www.osgeo.org/>`__ organized the `OSGeo UN Committee Educational Challenge <https://www.osgeo.org/foundation-news/2021-osgeo-un-committee-educational-challenge>`__ where Challenge 2 was to create Workshop material for pgRouting. The challenge supports the objectives of the OSGeo UN Committee, i.e. promoting the development and use of open-source software that meets UN needs and supports the aims of the UN. pgRouting is not only useful for routing cars on roads but it can also be used to analyse water distribution networks, river flow or the connectivity of an electricity network. Currently, this workshop expands the pgRouting workshop by addressing Three of the Seventeen Sustainable Development Goals
sv: `FN:s OpenGIS-initiativ <http://unopengis.org/unopengis/main/main.php>`__ tillsammans med `OSGeo Foundation <https://www.osgeo.org/>`__ organiserade `OSGeo UN Committee Educational Challenge <https://www.osgeo.org/foundation-news/2021-osgeo-un-committee-educational-challenge>`__ där utmaning 2 var att skapa workshopmaterial för pgRouting. Utmaningen stöder målen för OSGeo FN-kommittén, dvs. att främja utveckling och användning av programvara med öppen källkod som uppfyller FN: s behov och stöder FN: s mål. pgRouting är inte bara användbart för att dirigera bilar på vägar utan det kan också användas för att analysera vattendistributionsnät, flodflöde eller anslutningen av ett elnät. För närvarande utökar denna workshop pgRouting-workshopen genom att ta upp tre av de sjutton målen för hållbar utveckling

source: Chapter Contents
sv: Kapitelinnehåll

source: United Nations
sv: Förenta nationerna

source: UN Flag
sv: FN-flagga

source: `Image Source <https://research.un.org/en/maps/flags/>`__
sv: `Bildkälla <https://research.un.org/en/maps/flags/>`__

source: The United Nations (UN) is an intergovernmental organization founded in 1945 that aims to maintain international peace and security and develop friendly relations among nations to achieve international cooperation. The UN has its headquarters in New York City in an international territory and has other main offices in Geneva, Nairobi, Vienna, and The Hague.
sv: Förenta Nationerna (FN) är en mellanstatlig organisation som grundades 1945 och som syftar till att upprätthålla internationell fred och säkerhet och utveckla vänskapliga relationer mellan nationer för att uppnå internationellt samarbete. FN har sitt högkvarter i New York City på ett internationellt territorium och har andra huvudkontor i Genève, Nairobi, Wien och Haag.

source: The Major Objectives of the UN are to:
sv: FN:s viktigaste mål är att:

source: Maintain International Peace and Security
sv: Upprätthålla internationell fred och säkerhet

source: Protect Human Rights
sv: Skydda mänskliga rättigheter

source: Deliver Humanitarian Aid
sv: Leverera humanitärt bistånd

source: Support Sustainable Development and Climate Action
sv: Stödja hållbar utveckling och klimatåtgärder

source: Uphold International Law
sv: Upprätthålla internationell rätt

source: What are the Sustainable Development Goals?
sv: Vad är målen för hållbar utveckling?

source: `Image Source <https://sdgs.un.org/>`__
sv: `Bildkälla <https://sdgs.un.org/>`__

source: The Sustainable Development Goals (SDGs) are 17 interconnected goals that were adopted by the United Nations in 2015 as a universal call to all the nations to take action to end poverty, hunger protects the planet from the overexploitation by global cooperation. UN aims to achieve the goals by ensuring that all people enjoy peace and prosperity. The seventeen goals are integrated and they recognize that action in one domain will affect outcomes in others. The goals also promote that the development must balanced ensuring social, economic and environmental sustainability. Countries have committed to prioritizing progress for those who's furthest behind. The following table gives an overview of all the Sustainable Development Goals.
sv: De globala målen för hållbar utveckling (SDG) är 17 sammankopplade mål som antogs av FN 2015 som en universell uppmaning till alla nationer att vidta åtgärder för att avskaffa fattigdom, hunger och skydda planeten från överexploatering genom globalt samarbete. FN strävar efter att uppnå målen genom att se till att alla människor åtnjuter fred och välstånd. De sjutton målen är integrerade och de erkänner att åtgärder inom ett område kommer att påverka resultaten inom andra områden. Målen främjar också att utvecklingen måste vara balanserad och säkerställa social, ekonomisk och miljömässig hållbarhet. Länderna har åtagit sig att prioritera framsteg för dem som ligger längst efter. Följande tabell ger en översikt över alla mål för hållbar utveckling.

source: **Overview of UN Sustainable Development Goals (SDGs)**
sv: **Översikt över FN:s mål för hållbar utveckling (SDG)**

source: Goal Number
sv: Målnummer

source: Goal Name
sv: Målets namn

source: Objective
sv: Målsättning

source: Goal 1
sv: Mål 1

source: No Poverty
sv: Ingen fattigdom

source: End poverty in all its forms everywhere
sv: Utrota fattigdom i alla dess former överallt

source: Goal 2
sv: Mål 2

source: Zero Hunger
sv: Noll hunger

source: End hunger, achieve food security and improved nutrition and promote sustainable agriculture
sv: Utrota hunger, uppnå tryggad livsmedelsförsörjning och förbättrad nutrition samt främja ett hållbart jordbruk

source: Goal 3
sv: Mål 3

source: Good Health and Well Being
sv: God hälsa och välbefinnande

source: Ensure healthy lives and promote well-being for all at all ages
sv: Säkerställa hälsosamma liv och främja välbefinnande för alla i alla åldrar

source: Goal 4
sv: Mål 4

source: Quality Education
sv: Utbildning av hög kvalitet

source: Ensure inclusive and equitable quality education and promote lifelong learning opportunities for all
sv: Säkerställa inkluderande och rättvis utbildning av god kvalitet och främja möjligheter till livslångt lärande för alla

source: Goal 5
sv: Mål 5

source: Gender Equality
sv: Jämställdhet mellan kvinnor och män

source: Achieve gender equality and empower all women and girls
sv: Uppnå jämställdhet mellan könen och stärka alla kvinnors och flickors egenmakt

source: Goal 6
sv: Mål 6

source: Clean Water and Sanitation
sv: Rent vatten och sanitet

source: Ensure availability and sustainable management of water and sanitation for all
sv: Säkerställa tillgång till och hållbar förvaltning av vatten och sanitet för alla

source: Goal 7
sv: Mål 7

source: Affordable and Clean Energy
sv: Prisvärd och ren energi

source: Ensure access to affordable, reliable, sustainable and modern energy for all
sv: Säkerställa tillgång till prisvärd, tillförlitlig, hållbar och modern energi för alla

source: Goal 8
sv: Mål 8

source: Decent Work and Economic Growth
sv: Anständiga arbetsvillkor och ekonomisk tillväxt

source: Promote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all
sv: Främja varaktig, inkluderande och hållbar ekonomisk tillväxt, full och produktiv sysselsättning och anständigt arbete för alla

source: Goal 9
sv: Mål 9

source: Industry Innovation and Infrastructure
sv: Industriell innovation och infrastruktur

source: Build resilient infrastructure, promote inclusive and sustainable industrialization and foster innovation
sv: Bygga motståndskraftig infrastruktur, främja inkluderande och hållbar industrialisering och stimulera innovation

source: Goal 10
sv: Mål 10

source: Reduced Inequalities
sv: Minskad ojämlikhet

source: Reduce inequality within and among countries
sv: Minska ojämlikheten inom och mellan länder

source: Goal 11
sv: Mål 11

source: Sustainable Cities and Communities
sv: Hållbara städer och samhällen

source: Make cities and human settlements inclusive, safe, resilient and sustainable
sv: Göra städer och bosättningar inkluderande, säkra, motståndskraftiga och hållbara

source: Goal 12
sv: Mål 12

source: Responsible Consumption and Production
sv: Ansvarsfull konsumtion och produktion

source: Ensure sustainable consumption and production patterns
sv: Säkerställa hållbara konsumtions- och produktionsmönster

source: Goal 13
sv: Mål 13

source: Climate Action
sv: Klimatåtgärder

source: Take urgent action to combat climate change and its impacts
sv: Vidta brådskande åtgärder för att bekämpa klimatförändringarna och dess effekter

source: Goal 14
sv: Mål 14

source: Life Below Water
sv: Livet under vattenytan

source: Conserve and sustainably use the oceans, seas and marine resources for sustainable development
sv: Bevara och hållbart använda oceaner, hav och marina resurser för hållbar utveckling

source: Goal 15
sv: Mål 15

source: Life on Land
sv: Livet på land

source: Protect, restore and promote sustainable use of terrestrial ecosystems, sustainably manage forests, combat desertification, and halt and reverse land degradation and halt biodiversity loss
sv: Skydda, återställa och främja hållbar användning av landbaserade ekosystem, hållbart förvalta skogar, bekämpa ökenspridning, stoppa och vända markförstöring och stoppa förlusten av biologisk mångfald

source: Goal 16
sv: Mål 16

source: Peace, Justice and Strong Institutions
sv: Fred, rättvisa och starka institutioner

source: Promote peaceful and inclusive societies for sustainable development, provide access to justice for all and build effective, accountable and inclusive institutions at all levels
sv: Främja fredliga och inkluderande samhällen för hållbar utveckling, ge alla tillgång till rättvisa och bygga upp effektiva, ansvarsfulla och inkluderande institutioner på alla nivåer

source: Goal 17
sv: Mål 17

source: Partnerships for the Goals
sv: Partnerskap för att nå målen

source: Strengthen the means of implementation and revitalize the global partnership for sustainable development
sv: Stärka medlen för genomförande och återuppliva det globala partnerskapet för hållbar utveckling

source: More on Sustainable Development Goals can be found at this `link <https://sdgs.un.org/goals>`__.
sv: Mer om målen för hållbar utveckling finns på denna länk <https://sdgs.un.org/goals>`__.

source: Currently this workshop addresses three of the seventeen Sustainable Development Goals and covers the following:
sv: För närvarande behandlar denna workshop tre av de sjutton målen för hållbar utveckling och omfattar följande:

source: Data for Sustainable Development Goals
sv: Data för målen för hållbar utveckling

source: UN SDG 3: Good Health and Well Being
sv: FN:s globala mål 3: God hälsa och välbefinnande

source: UN SDG 11: Sustainable Cities and Communities
sv: FN:s globala mål 11: Hållbara städer och samhällen

source: UN SDG 7: Affordable and Clean Energy
sv: FN:s globala mål 7: Hållbar energi för alla

source: Target Audience
sv: Målgrupp

source: This educational material can be used by researchers, educators and in local,regional, national or international agencies who have some knowledge of PostGIS and PostgreSQL, and want to teach themselves how to use pgRouting. It is recommended to have a basic knowledge of database management systems and geospatial data structures and formats.
sv: Detta utbildningsmaterial kan användas av forskare, lärare och i lokala, regionala, nationella eller internationella byråer som har viss kunskap om PostGIS och PostgreSQL och vill lära sig själva hur man använder pgRouting. Det rekommenderas att ha grundläggande kunskaper om databashanteringssystem och geospatiala datastrukturer och format.

source: Prerequisites for UN SDG Exercises
sv: Förutsättningar för FN:s SDG-övningar

source: Workshop level: Advanced
sv: Workshopnivå: Avancerad

source: Previous knowledge: SQL (PostgreSQL, PostGIS), a brief idea about the applications of GIS and pgRouting
sv: Tidigare kunskap: SQL (PostgreSQL, PostGIS), en kort uppfattning om tillämpningarna av GIS och pgRouting

source: Brief idea about applications of GIS and pgRouting
sv: Kortfattad idé om tillämpningar av GIS och pgRouting

source: System Requirements: This workshop uses OSGeoLive (The latest available version)
sv: Systemkrav: Denna workshop använder OSGeoLive (den senaste tillgängliga versionen)

source: Basic chapters pgRouting Workshop
sv: Grundläggande kapitel pgRouting Workshop
