Repository: cvvergara/workshop
Catalog: locale/*/LC_MESSAGES/appendix/appendix-2.po
Languages: sv

source: Appendix: Installation
sv: Bilaga: Installation

source: For this workshop you need:
sv: För denna workshop behöver du:

source: Linux operating system like Ubuntu
sv: Linux-operativsystem som Ubuntu

source: An editor like Gedit, Medit or similar
sv: En redigerare som Gedit, Medit eller liknande

source: `Geoserver <https://live.osgeo.org/en/quickstart/geoserver_quickstart.html>`__ for the routing application
sv: `Geoserver <https://live.osgeo.org/en/quickstart/geoserver_quickstart.html>`__ för routing-applikationen

source: Internet connection
sv: Internetanslutning

source: `Install pgRouting on a Windows computer <https://postgis.net/windows_downloads/>`__.
sv: `Installera pgRouting på en Windows-dator <https://postgis.net/windows_downloads/>`__.

source: The following reference is a quick summary of how to install it on your own computer running Ubuntu 14.04 or later.
sv: Följande referens är en snabb sammanfattning av hur du installerar det på din egen dator som kör Ubuntu 14.04 eller senare.

source: pgRouting on Ubuntu can be installed using packages from a `PostgreSQL repository <https://apt.postgresql.org/pub/repos/apt/>`__:
sv: pgRouting på Ubuntu kan installeras med hjälp av paket från ett `PostgreSQL-arkiv <https://apt.postgresql.org/pub/repos/apt/>`__:

source: Using a terminal window:
sv: Använda ett terminalfönster:

source: This will also install all required packages such as PostgreSQL and PostGIS if not installed yet.
sv: Detta kommer också att installera alla nödvändiga paket som PostgreSQL och PostGIS om de inte är installerade ännu.

source: To be up-to-date with changes and improvements
sv: Att hålla sig uppdaterad om förändringar och förbättringar

source: To avoid permission denied errors for local users you can set connection method to ``trust`` in ``/etc/postgresql/<version>/main/pg_hba.conf`` and restart PostgreSQL server with ``sudo service postgresql restart``.
sv: För att undvika fel med nekad behörighet för lokala användare kan du ställa in anslutningsmetod till ``trust`` i ``/etc/postgresql/<version>/main/pg_hba.conf`` och starta om PostgreSQL-servern med ```sudo service postgresql restart``.

source: Following the example with PostgreSQL 10:
sv: Följ exemplet med PostgreSQL 10:
